[
  {
    "title": "Teaching Open Neuroscience at the African Brain Data Science Academy",
    "date": "2025-01-14",
    "description": "Reflections on teaching open neuroscience tools and practices at the African Brain Data Science Academy",
    "image": "/images/ABDS2024/1734435457699.jpeg",
    "readTime": "7 min read",
    "keywords": [
      "neuroscience",
      "education",
      "Africa",
      "ABDS",
      "open science",
      "data science"
    ],
    "gallery": [],
    "slug": "teaching-open-neuroscience-abds",
    "content": "\n# Teaching Open Neuroscience at the African Brain Data Science Academy\n\nLast month, I had the privilege of participating as an instructor at the African Brain Data Science (ABDS) Academy, an innovative initiative sponsored by the Kavli Foundation. This groundbreaking program, organized by Damian Eke and Eberechi Wogu from the African Brain Data Network (ABDN), brought together talented African researchers in data science and neuroscience to explore cutting-edge open data practices and analysis techniques.\n\n## Bridging the Gap in Neuroscience Data Science\n\nThe ABDS Academy serves a crucial role in democratizing access to modern neuroscience tools and methodologies. A highlight of the program was the comprehensive coverage of neuroimaging platforms and tools, led by experts in their respective fields. Franco Pestili guided the BrainLife sessions along with team members Anibal Heinsfeld and Sihang (Suna) Guo, while James Kent conducted engaging workshops on NeuroSynth. Participants received hands-on training in discovering and analyzing open neuroimaging datasets across these platforms.\n\n## Hands-on Data Discovery and Analysis\n\nA significant portion of our sessions focused on practical skills for working with open datasets. Participants learned how to effectively navigate neurophysiology archives to find relevant data for their research questions. We walked through the process of searching data repositories, understanding dataset metadata, and identifying suitable datasets for analysis. Using tools like Neurosift, researchers gained hands-on experience in visualizing and analyzing neurophysiology data directly from the archives. This practical approach ensured that participants left with not just theoretical knowledge, but the actual skills needed to work with open datasets in their research.\n\n## Educational Sessions and Resources\n\nAs part of the program, I contributed by leading two main sessions. The first focused on Neurodata Without Borders (NWB) and DANDI, where I introduced participants to these essential tools for standardizing and sharing neurophysiology data, demonstrating how they're revolutionizing data collaboration in neuroscience research.\n\n![Collaborative Learning](/images/ABDS2024/1734435457136.jpeg)\n\n\n<div class=\"gallery\" data-images=\"/images/ABDS2024/1734435457725.jpeg\" data-width=\"500px\" data-aspect=\"3/4\"></div>\n\n\nThe second session centered on open educational resources in computational neuroscience. I shared information about programs like Neuromatch Academy and NeuroHackademy, as well as popular MOOC platforms including Coursera, EdX, and MIT OpenCourseWare. These resources provide invaluable opportunities for continued learning and development in computational neuroscience.\n\n## Cross-Platform Synergies\n\nOne of the most exciting aspects of the Academy was discovering the natural synergies between different neuroscience tooling ecosystems. The combination of BrainLife's neuroimaging capabilities, NeuroSynth's meta-analysis tools, and NWB's data standardization framework revealed powerful opportunities for integrated workflows. These connections highlighted how researchers can leverage multiple platforms to create more comprehensive and robust analysis pipelines.\n\n## The Perfect Learning Environment at Brackenhurst\n\nThe success of the Academy was greatly enhanced by its location at Brackenhurst, a beautiful retreat center in Kenya. The serene setting provided the ideal environment for focused learning and collaboration. The well-equipped classroom facilities supported our technical sessions, while the comfortable accommodations and provided meals allowed participants to fully immerse themselves in the learning experience without external distractions.\n\nThe spacious grounds and communal areas fostered natural networking opportunities, enabling instructors and attendees to continue discussions beyond the formal sessions. These informal interactions proved invaluable for building lasting connections within the African neuroscience community. The peaceful atmosphere of Brackenhurst, combined with its excellent facilities, created an environment where both teaching and learning could flourish.\n\nBrackenhurst was home also to some impressive Kenyan wildlife, including monkeys!\n\n## Safari Adventure at Nairobi National Park\n\nOne of the highlights of our time together was a memorable safari trip to Nairobi National Park, generously organized by one of the instructors, Silke Anders. The entire school had the incredible opportunity to experience Kenya's magnificent wildlife firsthand. We were fortunate to observe a diverse array of animals in their natural habitat, including majestic giraffes, powerful lions, endangered rhinoceros, and striking zebras. This shared adventure not only provided a welcome break from our intensive academic sessions but also fostered stronger bonds between ABDS students and instructors.\n\n\n\n## Impact and Future Directions\n\nThe ABDS Academy represents a significant step forward in building capacity for neuroscience research in Africa. By providing access to modern tools and platforms for data analysis and sharing, we're helping to ensure that African researchers can fully participate in and contribute to the global neuroscience community.\n\nThis initiative aligns perfectly with the growing movement toward open science and data sharing in neuroscience. Through programs like ABDS, we're not just teaching technical skills – we're fostering a community of researchers who can collaborate effectively across borders and contribute to the advancement of neuroscience research worldwide.\n"
  },
  {
    "title": "CatalystNeuro Team Retreat 2024: Strategy and Connection in Montecatini, Italy",
    "date": "2024-10-01",
    "description": "The CatalystNeuro team gathered in the beautiful Tuscan town of Montecatini for a retreat combining strategic planning with cultural experiences and team bonding.",
    "image": "/images/retreat-2024/lucca/0V8A8033.jpg",
    "readTime": "4 min read",
    "keywords": [
      "CatalystNeuro",
      "company retreat",
      "Montecatini",
      "Italy",
      "team building",
      "Tuscany"
    ],
    "gallery": [],
    "slug": "retreat-2024-montecatini-italy",
    "content": "\nIn October 2024, the CatalystNeuro team gathered in the charming Tuscan town of Montecatini for our annual retreat. Nestled in a beautiful villa, we spent several enriching days combining strategic planning with cultural experiences and team bonding activities.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2024/villa/000V8A8069.jpg|/images/retreat-2024/villa/0V8A8040.jpg|/images/retreat-2024/villa/0V8A8051.jpg|/images/retreat-2024/villa/0V8A9481.jpg\" data-aspect=\"16/9\"></div>\n\n## Strategic Planning and Vision\n\nOur retreat focused heavily on streamlining our approach to data conversion projects and software engineering initiatives. Through focused discussions and collaborative sessions, we worked on refining our processes and aligning our vision for the future of neuroscience data standardization.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2024/meetings/0V8A8938.jpg|/images/retreat-2024/meetings/0V8A8977.jpg|/images/retreat-2024/meetings/0V8A8988.jpg|/images/retreat-2024/meetings/0V8A9028.jpg|/images/retreat-2024/meetings/0V8A9037.jpg|/images/retreat-2024/meetings/0V8A9044.jpg|/images/retreat-2024/meetings/0V8A9449.jpg\" data-aspect=\"16/9\"></div>\n\n## Cultural Experiences\n\n### A Special Culinary Lesson\nOne of the most memorable highlights of our retreat was an intimate cooking session where Alessandra shared her family's treasured lasagna recipe. The kitchen came alive with stories of Italian culinary traditions as we learned the precise techniques and secret ingredients that make this generational recipe so special. This hands-on experience not only resulted in a delicious meal but also gave us a genuine taste of Italian family culture.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2024/lasagna/0V8A9185.jpg|/images/retreat-2024/lasagna/0V8A9194.jpg|/images/retreat-2024/lasagna/0V8A9247.jpg|/images/retreat-2024/lasagna/0V8A9275.jpg|/images/retreat-2024/lasagna/0V8A9291.jpg|/images/retreat-2024/lasagna/0V8A9315.jpg|/images/retreat-2024/lasagna/0V8A9333.jpg|/images/retreat-2024/lasagna/0V8A9354.jpg|/images/retreat-2024/lasagna/0V8A9379.jpg|/images/retreat-2024/lasagna/0V8A9412.jpg|/images/retreat-2024/lasagna/0V8A9424.jpg|/images/retreat-2024/lasagna/0V8A9429.jpg\" data-aspect=\"1/1\"></div>\n\n### Exploring Lucca\nWe took a fascinating walking tour of nearby Lucca, a city famous for its well-preserved Renaissance walls. The team enjoyed exploring the narrow medieval streets and historic churches.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2024/lucca/0V8A7843.jpg|/images/retreat-2024/lucca/0V8A7901.jpg|/images/retreat-2024/lucca/0V8A7914.jpg|/images/retreat-2024/lucca/0V8A7925.jpg|/images/retreat-2024/lucca/0V8A7931.jpg|/images/retreat-2024/lucca/0V8A8021.jpg|/images/retreat-2024/lucca/0V8A8026.jpg|/images/retreat-2024/lucca/0V8A8028.jpg|/images/retreat-2024/lucca/0V8A8033.jpg\" data-aspect=\"16/9\"></div>\n\n## Team Building and Connection\n\nA significant portion of our retreat was dedicated to team building activities. Through carefully designed sessions, we were able to connect on a deeper level, strengthening our bonds as a team. These moments of genuine connection and shared experiences help us work more effectively together in our mission to advance neuroscience data standards.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2024/team-building/0V8A8136.jpg|/images/retreat-2024/team-building/0V8A8140.jpg|/images/retreat-2024/team-building/0V8A8305.jpg|/images/retreat-2024/team-building/0V8A8347.jpg|/images/retreat-2024/team-building/0V8A8359.jpg|/images/retreat-2024/team-building/0V8A8438.jpg|/images/retreat-2024/team-building/0V8A8448.jpg|/images/retreat-2024/team-building/0V8A8514.jpg|/images/retreat-2024/team-building/0V8A8567.jpg|/images/retreat-2024/team-building/0V8A8585.jpg|/images/retreat-2024/team-building/0V8A8612.jpg|/images/retreat-2024/team-building/0V8A8634.jpg|/images/retreat-2024/team-building/0V8A8650.jpg|/images/retreat-2024/team-building/0V8A8698.jpg|/images/retreat-2024/team-building/0V8A8774.jpg|/images/retreat-2024/team-building/0V8A8801.jpg\" data-aspect=\"1/1\"></div>\n\n### Wine Tasting Experience\nNo visit to Tuscany would be complete without experiencing its renowned wine culture. We participated in a wine tasting session that not only educated us about the region's famous wines but also provided another opportunity for team bonding in a relaxed setting.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2024/wine-tasting/0V8A9536.jpg|/images/retreat-2024/wine-tasting/0V8A9548.jpg|/images/retreat-2024/wine-tasting/0V8A9571.jpg|/images/retreat-2024/wine-tasting/0V8A9577.jpg\" data-aspect=\"1/1\"></div>\n\n## Looking Forward\n\nThis retreat in Montecatini proved to be an invaluable opportunity to align our team's vision, strengthen our connections, and energize ourselves for the challenges and opportunities ahead. The combination of strategic planning and team building activities in such a beautiful setting has set us up for continued success in our mission to advance neuroscience data standards.\n\nThe memories and connections forged during our time in Montecatini will continue to inspire and motivate us as we work together to shape the future of neuroscience data management. This retreat wasn't just about planning and strategy—it was about strengthening the human connections that make our team truly effective.\n"
  },
  {
    "title": "CatalystNeuro Team Retreat 2023: A Week in Catalonia",
    "date": "2023-10-01",
    "description": "The CatalystNeuro team gathered in a historic Catalan villa for a week of strategic planning, cultural experiences, and team bonding in the beautiful Costa Brava region.",
    "image": "/images/retreat-2023/cover.jpg",
    "readTime": "4 min read",
    "keywords": [
      "CatalystNeuro",
      "company retreat",
      "Catalonia",
      "Spain",
      "team building",
      "Costa Brava"
    ],
    "gallery": [],
    "slug": "retreat-2023-catalonia-spain",
    "content": "\nThe CatalystNeuro team came together in October 2023 for our annual retreat, this time in the stunning Costa Brava region of Catalonia, Spain. Our home for the week was a magnificent 15-bedroom villa, Villa Mas Sant Jordi, nestled in a private 30-hectare estate surrounded by serene forests and cultivated fields.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2023/villa/0V8A2041.jpg|/images/retreat-2023/villa/0V8A2052.jpg|/images/retreat-2023/villa/0V8A2068.jpg|/images/retreat-2023/villa/0V8A2167.jpg\" data-aspect=\"16/9\"></div>\n\n### Strategic Planning and Collaboration\n\nOur days began with productive morning sessions, starting with Ben's State of the Union address that set the tone for our strategic discussions. The villa's spacious rooms and peaceful surroundings provided the perfect setting for focused work on our ongoing projects and future initiatives.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2023/meetings/0V8A2020.jpg|/images/retreat-2023/meetings/0V8A2080.jpg|/images/retreat-2023/meetings/0V8A2131.jpg|/images/retreat-2023/meetings/0V8A2239.jpg|/images/retreat-2023/meetings/0V8A2415.jpg\" data-aspect=\"16/9\"></div>\n\n### Exploring Girona\n\nA highlight of our cultural experiences was exploring the historic city of Girona. We took a guided walking tour through its medieval streets and ancient walls, learning about the city's rich history that spans over two millennia. The tour included visits to the iconic Cathedral of Girona, the well-preserved Jewish Quarter, and the colorful houses along the River Onyar.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2023/tour of girona/0V8A3446.jpg|/images/retreat-2023/tour of girona/0V8A3470.jpg|/images/retreat-2023/tour of girona/0V8A3473.jpg|/images/retreat-2023/tour of girona/0V8A3477.jpg|/images/retreat-2023/tour of girona/0V8A3495.jpg|/images/retreat-2023/tour of girona/0V8A3552.jpg|/images/retreat-2023/tour of girona/0V8A3562.jpg|/images/retreat-2023/tour of girona/0V8A3575.jpg|/images/retreat-2023/tour of girona/0V8A3578.jpg|/images/retreat-2023/tour of girona/0V8A3580.jpg|/images/retreat-2023/tour of girona/0V8A3601.jpg|/images/retreat-2023/tour of girona/0V8A3694.jpg|/images/retreat-2023/tour of girona/0V8A3815.jpg|/images/retreat-2023/tour of girona/0V8A3817.jpg\" data-aspect=\"16/9\"></div>\n\n### Art and Culture\n\nAnother cultural highlight was our visit to the Salvador Dalí Museum in Figueres. The museum, housed in what was once the town's theater, is itself a work of art designed by Dalí himself. We explored the largest collection of the artist's works, from his early experiments to his most famous surrealist masterpieces.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2023/dali musem/0V8A6868.jpg|/images/retreat-2023/dali musem/0V8A6875.jpg|/images/retreat-2023/dali musem/0V8A6888.jpg|/images/retreat-2023/dali musem/0V8A6906.jpg|/images/retreat-2023/dali musem/0V8A6913.jpg|/images/retreat-2023/dali musem/0V8A6928.jpg|/images/retreat-2023/dali musem/0V8A7065.jpg\" data-aspect=\"16/9\"></div>\n\n### Team Building and Recreation\n\nThe villa's extensive grounds offered plenty of opportunities for team bonding. The soccer field became a hub of friendly competition, with impromptu matches bringing out everyone's playful spirit. These casual sporting activities provided a perfect balance to our intensive work sessions.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2023/soccer/0V8A2554.jpg|/images/retreat-2023/soccer/0V8A2556.jpg|/images/retreat-2023/soccer/0V8A2567.jpg|/images/retreat-2023/soccer/0V8A2587.jpg|/images/retreat-2023/soccer/0V8A2629.jpg|/images/retreat-2023/soccer/0V8A3017.jpg\" data-aspect=\"16/9\"></div>\n\n### Culinary Experiences\n\nOur evenings were filled with wonderful Spanish cuisine. We enjoyed traditional paella, authentic Spanish barbecues, and tapas dinners both at the villa and at local restaurants. These shared meals became cherished moments for casual conversations and strengthening team bonds.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2023/out to dinner/0V8A7129.jpg|/images/retreat-2023/out to dinner/0V8A7134.jpg|/images/retreat-2023/out to dinner/0V8A7135.jpg|/images/retreat-2023/out to dinner/0V8A7137.jpg|/images/retreat-2023/out to dinner/0V8A7189.jpg|/images/retreat-2023/out to dinner/0V8A7191.jpg\" data-aspect=\"16/9\"></div>\n\n### Beach and Coastal Adventures\n\nBeing just 15 minutes from the golden beaches of Costa Brava, we took full advantage of the location with beach visits and coastal hikes. The Mediterranean landscape provided a stunning backdrop for our outdoor activities, and we even explored a historic coastal castle, adding an element of medieval history to our natural adventures.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2023/beach and castle/0V8A7195.jpg|/images/retreat-2023/beach and castle/0V8A7200.jpg|/images/retreat-2023/beach and castle/0V8A7202.jpg|/images/retreat-2023/beach and castle/0V8A7210.jpg|/images/retreat-2023/beach and castle/0V8A7217.jpg|/images/retreat-2023/beach and castle/0V8A7225.jpg|/images/retreat-2023/beach and castle/0V8A7231.jpg|/images/retreat-2023/beach and castle/0V8A7236.jpg|/images/retreat-2023/beach and castle/0V8A7249.jpg|/images/retreat-2023/beach and castle/0V8A7268.jpg\" data-aspect=\"16/9\"></div>\n\nOur week in Catalonia was more than just a retreat—it was a perfect blend of productive work sessions, cultural exploration, and team bonding. The combination of the villa's peaceful setting, the region's rich culture, and our focused collaborative sessions helped us align our vision and strengthen our commitment to advancing neuroscience data standards. As we returned to our respective locations around the world, we carried with us not just new strategies and plans, but also stronger connections and cherished memories of our time together in this beautiful corner of Spain.\n\n![Team photo](/images/retreat-2023/group_photo.jpg)\n"
  },
  {
    "title": "CatalystNeuro Team Retreat 2022: Uniting in Portugal's Douro Valley",
    "date": "2022-10-14",
    "description": "After months of remote work, the CatalystNeuro team gathered in Portugal's historic Douro Valley for their first post-lockdown retreat, combining strategic planning with cultural immersion.",
    "image": "/images/retreat-2022/IMG_4679.jpeg",
    "readTime": "4 min read",
    "keywords": [
      "CatalystNeuro",
      "company retreat",
      "Douro Valley",
      "Portugal",
      "team building"
    ],
    "gallery": [],
    "slug": "retreat-2022-douro-portugal",
    "content": "\n\nAfter months of Zoom calls and virtual collaboration during the global lockdown, our CatalystNeuro team finally gathered in person for an unforgettable retreat in Portugal's stunning Douro Valley. As the team assembled from various countries, we took the opportunity to explore Porto, Portugal.\n\nThe historic wine region, with its terraced vineyards and winding river, provided the perfect backdrop for strengthening team bonds and mapping out our company's future.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2022/IMG_4673.jpeg|/images/retreat-2022/IMG_4622.jpeg\" data-aspect=\"16/9\"></div>\n\n## A Historic Setting for a Historic Moment\n\nOur home base for the week was the magnificent Casa do Monte, a centuries-old restored farmhouse nestled in the heart of the Lower Corgo region.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2022/IMG_4659.jpeg|/images/retreat-2022/IMG_4664.jpeg|/images/retreat-2022/IMG_4667.jpeg|/images/retreat-2022/IMG_4668.jpeg\" data-aspect=\"16/9\"></div>\n\n\n## More Than Just a Business Retreat\n\nWhile our days were filled with productive strategy sessions and project planning, this retreat was about much more than work. For many team members, it was their first time meeting colleagues in person after years of remote collaboration. The joy of finally putting faces to Zoom squares and sharing meals together cannot be overstated.\n\nOur schedule balanced focused work sessions with time to experience local culture. Mornings were dedicated to strategic planning and project reviews, while afternoons and evenings allowed us to explore the region's rich heritage. A highlight was our walking tour through a nearby village, where we learned about local wine production – complete with tastings that gave us a literal flavor of the area's traditions.\n\n## Building the Future of Neuroscience Software\n\nThe retreat provided invaluable face-to-face time to discuss our ongoing projects and future directions. We dove deep into our work on NWB (Neurodata Without Borders) and DANDI, exploring ways to better serve the neuroscience community. The relaxed setting sparked creative discussions about improving our tools like SpikeInterface, VAME, and neurosift, with impromptu whiteboard sessions happening between dips in the pool.\n\n## Cultural Immersion\n\nBeing in Portugal wasn't just about the location – we embraced the culture wholeheartedly. From enjoying traditional Portuguese dinners at the villa to practicing our newly learned Portuguese phrases with locals, the team fully immersed themselves in the experience. The Douro Valley's UNESCO World Heritage status reminded us daily of the importance of preserving and building upon valuable legacy systems – a philosophy that resonates deeply with our work in neuroscience data standardization.\n\n<div class=\"gallery\" data-images=\"/images/retreat-2022/IMG_4692.jpeg|/images/retreat-2022/IMG_4711.jpeg|/images/retreat-2022/IMG_4720.jpeg\" data-aspect=\"16/9\"></div>\n\n## Looking Forward\n\nAs we returned to our respective corners of the world, we carried with us not just updated project plans and strategies, but stronger personal connections and renewed enthusiasm for our mission. The Portugal retreat marked a significant milestone in CatalystNeuro's journey, setting the stage for even greater collaboration and innovation in neuroscience software development.\n\n\nThis gathering in the Douro Valley wasn't just our first post-lockdown retreat – it was a celebration of resilience, teamwork, and the power of in-person connection. As we continue to grow and evolve as a company, we'll always look back on these few days in Portugal as a pivotal moment that strengthened our team and sharpened our vision for the future of neuroscience data management.\n"
  }
]